ma-xiao-ma/OBC_NJUST_NIMISAT/obc/bsp/bsp_stm32f4/src/bsp_nor_flash.c
	/*!< Enable FSMC Bank1_SRAM2 Bank */
	FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM2, ENABLE);
	
//	NOR_EraseChip();

//	ChipID = NOR_ReadID();
//	FSMC_NOR_ReadID();
//	if(ChipID == 0x017E0A00)
//	{

//	}
}


void FSMC_NOR_ReadID(void)
{
	uint16_t ka,kb,kc,kd;
  NOR_WRITE(WORD_ADDR(0x0555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AA), 0x0055);
  NOR_WRITE(WORD_ADDR(0x0555), 0x0090);

  ka = *(vu16 *) WORD_ADDR(0x0000);
  kb = *(vu16 *) WORD_ADDR(0x0001);
  kc = *(vu16 *) WORD_ADDR(0x000E);
  kd = *(vu16 *) WORD_ADDR(0x000F);

  printf("NorFlash ID = %x, %x, %x, %x\r\n",ka,kb,kc,kd);
}


NOR_STATUS FSMC_NOR_EraseBlock(u32 BlockAddr)
{
  NOR_WRITE(WORD_ADDR(0x05555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);
  NOR_WRITE(WORD_ADDR(0x05555), 0x0080);
  NOR_WRITE(WORD_ADDR(0x05555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);
  NOR_WRITE(WORD_ADDR(BlockAddr), 0x0030);

  return (FSMC_NOR_GetStatus(BlockErase_Timeout));
}

/*******************************************************************************
* Function Name  : FSMC_NOR_EraseChip
* Description    : Erases the entire chip.
* Input          : None
* Output         : None
* Return         : NOR_Status:The returned value can be: NOR_SUCCESS, NOR_ERROR
*                  or NOR_TIMEOUT
*******************************************************************************/
NOR_STATUS FSMC_NOR_EraseChip(void)
{
  NOR_WRITE(WORD_ADDR(0x05555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);
  NOR_WRITE(WORD_ADDR(0x05555), 0x0080);
  NOR_WRITE(WORD_ADDR(0x05555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);
  NOR_WRITE(WORD_ADDR(0x05555), 0x0010);

  return (FSMC_NOR_GetStatus(ChipErase_Timeout));
}

/******************************************************************************
* Function Name  : FSMC_NOR_WriteHalfWord
* Description    : Writes a half-word to the NOR memory.
* Input          : - WriteAddr : NOR memory internal address to write to.
*                  - Data : Data to write.
* Output         : None
* Return         : NOR_Status:The returned value can be: NOR_SUCCESS, NOR_ERROR
*                  or NOR_TIMEOUT
*******************************************************************************/
NOR_STATUS FSMC_NOR_WriteHalfWord(u32 WriteAddr, u16 Data)
{
  NOR_WRITE(WORD_ADDR(0x05555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);
  NOR_WRITE(WORD_ADDR(0x05555), 0x00A0);

  NOR_WRITE(WORD_ADDR(WriteAddr), Data);

  return (FSMC_NOR_GetStatus(Program_Timeout));
}

/*******************************************************************************
* Function Name  : FSMC_NOR_WriteBuffer
* Description    : Writes a half-word buffer to the FSMC NOR memory.
* Input          : - pBuffer : pointer to buffer.
*                  - WriteAddr : NOR memory internal address from which the data
*                    will be written.
*                  - NumHalfwordToWrite : number of Half words to write.
* Output         : None
* Return         : NOR_Status:The returned value can be: NOR_SUCCESS, NOR_ERROR
*                  or NOR_TIMEOUT
*******************************************************************************/
NOR_STATUS FSMC_NOR_WriteBuffer(u16* pBuffer, u32 WriteAddr, u32 NumHalfwordToWrite)
{
	NOR_STATUS status = NOR_ONGOING;

  do
  {
    /* Transfer data to the memory */
    status = FSMC_NOR_WriteHalfWord(WriteAddr, *pBuffer++);
    WriteAddr = WriteAddr + 1;
    NumHalfwordToWrite--;
  }
  while((status == NOR_SUCCESS) && (NumHalfwordToWrite != 0));

  return (status);
}

/*******************************************************************************
* Function Name  : FSMC_NOR_ProgramBuffer
* Description    : Writes a half-word buffer to the FSMC NOR memory. This function
*                  must be used only with S29GL128P NOR memory.
* Input          : - pBuffer : pointer to buffer.
*                  - WriteAddr: NOR memory internal address from which the data
*                    will be written.
*                  - NumHalfwordToWrite: number of Half words to write.
*                    The maximum allowed value is 32 Half words (64 bytes).
* Output         : None
* Return         : NOR_Status:The returned value can be: NOR_SUCCESS, NOR_ERROR
*                  or NOR_TIMEOUT
*******************************************************************************/
NOR_STATUS FSMC_NOR_ProgramBuffer(u16* pBuffer, u32 WriteAddr, u32 NumHalfwordToWrite)
{
  u32 lastloadedaddress = 0x00;
  u32 currentaddress = 0x00;
  u32 endaddress = 0x00;

  /* Initialize variables */
  currentaddress = WriteAddr;
  endaddress = WriteAddr + NumHalfwordToWrite - 1;
  lastloadedaddress = WriteAddr;

  /* Issue unlock command sequence */
  NOR_WRITE(WORD_ADDR(0x005555), 0x00AA);

  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);

  /* Write Write Buffer Load Command */
  NOR_WRITE(WORD_ADDR(WriteAddr), 0x0025);
  NOR_WRITE(WORD_ADDR(WriteAddr), (NumHalfwordToWrite - 1));

  /* Load Data into NOR Buffer */
  while(currentaddress <= endaddress)
  {
    /* Store last loaded address & data value (for polling) */
    lastloadedaddress = currentaddress;

    NOR_WRITE(WORD_ADDR(currentaddress), *pBuffer++);
    currentaddress += 1;
  }

  NOR_WRITE(WORD_ADDR(lastloadedaddress), 0x29);

  return(FSMC_NOR_GetStatus(Program_Timeout));
}

/******************************************************************************
* Function Name  : FSMC_NOR_ReadHalfWord
* Description    : Reads a half-word from the NOR memory.
* Input          : - ReadAddr : NOR memory internal address to read from.
* Output         : None
* Return         : Half-word read from the NOR memory
*******************************************************************************/
u16 FSMC_NOR_ReadHalfWord(u32 ReadAddr)
{
    /* 复位NOR_FLASH */
    NOR_WRITE((NOR_FLASH_ADDR + ReadAddr), 0x00F0);
    return (*(vu16 *)(WORD_ADDR(ReadAddr)));
}

/*******************************************************************************
* Function Name  : FSMC_NOR_ReadBuffer
* Description    : Reads a block of data from the FSMC NOR memory.
* Input          : - pBuffer : pointer to the buffer that receives the data read
*                    from the NOR memory.
*                  - ReadAddr : NOR memory internal address to read from.
*                  - NumHalfwordToRead : number of Half word to read.
* Output         : None
* Return         : None
*******************************************************************************/
void FSMC_NOR_ReadBuffer(u16* pBuffer, u32 ReadAddr, u32 NumHalfwordToRead)
{

