ma-xiao-ma/OBC_NJUST_NIMISAT/obc/bsp/bsp_stm32f4/src/bsp_nor_flash.c
  NOR_WRITE((NOR_FLASH_ADDR + ReadAddr), 0x00F0);

  for(; NumHalfwordToRead != 0x00; NumHalfwordToRead--) /* while there is data to read */
  {
    /* Read a Halfword from the NOR */
    *pBuffer++ = *(vu16 *)(WORD_ADDR(ReadAddr));
    ReadAddr = ReadAddr + 1;
  }
}

/******************************************************************************
* Function Name  : FSMC_NOR_ReturnToReadMode
* Description    : Returns the NOR memory to Read mode.
* Input          : None
* Output         : None
* Return         : NOR_SUCCESS
*******************************************************************************/
NOR_STATUS FSMC_NOR_ReturnToReadMode(void)
{
  NOR_WRITE(NOR_FLASH_ADDR, 0xF0);

  return (NOR_SUCCESS);
}

/******************************************************************************
* Function Name  : FSMC_NOR_Reset
* Description    : Returns the NOR memory to Read mode and resets the errors in
*                  the NOR memory Status Register.
* Input          : None
* Output         : None
* Return         : NOR_SUCCESS
*******************************************************************************/
NOR_STATUS FSMC_NOR_Reset(void)
{
  NOR_WRITE(WORD_ADDR(0x005555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x002AAA), 0x0055);
  NOR_WRITE(NOR_FLASH_ADDR, 0x00F0);

  return (NOR_SUCCESS);
}

/******************************************************************************
* Function Name  : FSMC_NOR_GetStatus
* Description    : Returns the NOR operation status.
* Input          : - Timeout: NOR progamming Timeout
* Output         : None
* Return         : NOR_Status:The returned value can be: NOR_SUCCESS, NOR_ERROR
*                  or NOR_TIMEOUT
*******************************************************************************/
NOR_STATUS FSMC_NOR_GetStatus(u32 Timeout)
{
  u16 val1 = 0x00, val2 = 0x00;
  NOR_STATUS status = NOR_ONGOING;
  u32 timeout = Timeout;

  /* Poll on NOR memory Ready/Busy signal ------------------------------------*/
  while((GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) != RESET) && (timeout > 0))
  {
    timeout--;
  }

  timeout = Timeout;

  while((GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == RESET) && (timeout > 0))
  {
    timeout--;
  }

  /* Get the NOR memory operation status -------------------------------------*/
  while((Timeout != 0x00) && (status != NOR_SUCCESS))
  {
    Timeout--;

   /* Read DQ6 and DQ5 */
    val1 = *(vu16 *)(NOR_FLASH_ADDR);
    val2 = *(vu16 *)(NOR_FLASH_ADDR);

    /* If DQ6 did not toggle between the two reads then return NOR_Success */
    if((val1 & 0x0040) == (val2 & 0x0040))
    {
      return NOR_SUCCESS;
    }

    if((val1 & 0x0020) != 0x0020)
    {
      status = NOR_ONGOING;
    }

    val1 = *(vu16 *)(NOR_FLASH_ADDR);
    val2 = *(vu16 *)(NOR_FLASH_ADDR);

    if((val1 & 0x0040) == (val2 & 0x0040))
    {
      return NOR_SUCCESS;
    }
    else if((val1 & 0x0020) == 0x0020)
    {
      return NOR_ERROR;
    }
  }

  if(Timeout == 0x00)
  {
    status = NOR_TIMEOUT;
  }

  /* Return the operation status */
  return (status);
}

/******************************************************************************
* 函数名        : USER_NOR_SectorErase
* 描述            : 片外NorFlash扇区擦除，扇区详细描述详见芯片手册S29JL032L第19页 SA0-SA7 每个扇区8K Bytes
*           SA8-SA70每个扇区64K Bytes
* 输入            : - SectorNum: 需要擦除的扇区编号 0-70
* 输出            : None
* 返回            : NOR_Status:擦除状态，返回值可能为: NOR_SUCCESS(0), NOR_ERROR(2)
*                  或NOR_TIMEOUT(3)
*******************************************************************************/
NOR_STATUS USER_NOR_SectorErase(u8 SectorNum)
{
  NOR_WRITE(WORD_ADDR(0x05555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);
  NOR_WRITE(WORD_ADDR(0x05555), 0x0080);
  NOR_WRITE(WORD_ADDR(0x05555), 0x00AA);
  NOR_WRITE(WORD_ADDR(0x02AAA), 0x0055);
  if(SectorNum < 8)
      NOR_WRITE(WORD_ADDR(SectorNum * 4096), 0x0030);
  else
      NOR_WRITE(WORD_ADDR((SectorNum-7) * 32768), 0x0030);

  return (FSMC_NOR_GetStatus(BlockErase_Timeout));
}


uint32_t NOR_ReadID(void)
{
	uint32_t uiID;
	uint8_t id1, id2, id3, id4;

	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0x90);
	NOR_BWRITE(BYTE_ADDR(0x00), 0x01);

	id1 = *(__IO uint8_t *) BYTE_ADDR(0x00);
	id2 = *(__IO uint8_t *) BYTE_ADDR(0x01);
	id3 = *(__IO uint8_t *) BYTE_ADDR(0x0E);
	id4 = *(__IO uint8_t *) BYTE_ADDR(0x0F);

	uiID = ((uint32_t)id1 << 24) | ((uint32_t)id2 << 16)  | ((uint32_t)id3 << 8) | id4;

//	NOR_BWRITE(NOR_FLASH_ADDR, 0xF0);		/* 退出ID模式 */

	return uiID;
}

static void NOR_QuitToReadStatus(void)
{
	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE(NOR_FLASH_ADDR, 0xF0);
}

static uint8_t NOR_GetStatus(uint32_t Timeout)
{
	uint8_t val1 = 0x00;
	uint8_t val2 = 0x00;
	uint8_t status = NOR_ONGOING;
	uint32_t timeout = Timeout;

	while ((!NOR_IS_BUSY()) && (timeout > 0))
	{
		timeout--;
	}

	/* 等待NOR输出忙信号，高电平时等待，避免NOR的忙信号还未反映过来导致CPU提前认为不忙了  */
	timeout = Timeout;
	while(NOR_IS_BUSY() && (timeout > 0))
	{
		timeout--;
	}

	while ((Timeout != 0x00) && (status != NOR_SUCCESS))
	{
		Timeout--;

		/* Read DQ6 */
		val1 = *(__IO uint8_t *)(NOR_FLASH_ADDR);
		val2 = *(__IO uint8_t *)(NOR_FLASH_ADDR);

		/* If DQ6 did not toggle between the two reads then return NOR_Success */
		if ((val1 & 0x40) == (val2 & 0x40))
		{
			return NOR_SUCCESS;
		}

		/* Read DQ2 */
		if((val1 & 0x20) != 0x20)
		{
			status = NOR_ONGOING;
		}

		val1 = *(__IO uint8_t *)(NOR_FLASH_ADDR);
		val2 = *(__IO uint8_t *)(NOR_FLASH_ADDR);

		if((val1 & 0x40) == (val2 & 0x40))
		{
			return NOR_SUCCESS;
		}
		else if ((val1 & 0x20) == 0x20)
		{
			status = NOR_ERROR;
			NOR_QuitToReadStatus();
		}
	}

	if (Timeout == 0x00)
	{
		status = NOR_TIMEOUT;
		NOR_QuitToReadStatus();
	}

	return (status);
}

