ma-xiao-ma/OBC_NJUST_NIMISAT/obc/bsp/bsp_stm32f4/src/bsp_nor_flash.c
uint8_t NOR_EraseChip(void)
{
	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0x80);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0x10);

	return NOR_GetStatus(ChipErase_Timeout);
}

uint8_t NOR_StartEraseChip(void)
{
	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0x80);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0x10);
	
	return NOR_GetStatus(1000);
}

uint8_t NOR_EraseSector(uint32_t _uiBlockAddr)
{
	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0x80);
	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
	NOR_BWRITE((NOR_FLASH_ADDR + _uiBlockAddr), 0x30);

	return (NOR_GetStatus(BlockErase_Timeout));
}

//uint8_t NOR_EraseSector(uint32_t _uiBlockAddr)
//{
//	NOR_BWRITE(BYTE_ADDR(0xAAA), 0xAA);
//	NOR_BWRITE(BYTE_ADDR(0x555), 0x55);
//	NOR_BWRITE(BYTE_ADDR(0xAAA), 0x80);
//	NOR_BWRITE(BYTE_ADDR(0xAAA), 0xAA);
//	NOR_BWRITE(BYTE_ADDR(0x555), 0x55);
//	NOR_BWRITE((NOR_FLASH_ADDR + _uiBlockAddr), 0x30);
//
//	return (NOR_GetStatus(BlockErase_Timeout));
//}

uint8_t NOR_CheckStatus(void)
{
	uint8_t val1 = 0x00;
	uint8_t val2 = 0x00;
	uint8_t status = NOR_ONGOING;
	uint32_t timeout = 10;
	
	while ((timeout != 0x00) && (status != NOR_SUCCESS))
	{
		timeout--;

		/* Read DQ6 */
		val1 = *(__IO uint8_t *)(NOR_FLASH_ADDR);
		val2 = *(__IO uint8_t *)(NOR_FLASH_ADDR);

		/* If DQ6 did not toggle between the two reads then return NOR_Success */
		if ((val1 & 0x40) == (val2 & 0x40))
		{
			return NOR_SUCCESS;
		}

		/* Read DQ2 */
		if((val1 & 0x20) != 0x20)
		{
			status = NOR_ONGOING;
		}

		val1 = *(__IO uint8_t *)(NOR_FLASH_ADDR);
		val2 = *(__IO uint8_t *)(NOR_FLASH_ADDR);

		if((val1 & 0x40) == (val2 & 0x40))
		{
			return NOR_SUCCESS;
		}
		else if ((val1 & 0x20) == 0x20)
		{
			status = NOR_ERROR;
			NOR_QuitToReadStatus();
		}
	}

	if (timeout == 0x00)
	{
		status = NOR_TIMEOUT;
		//NOR_QuitToReadStatus();
	}

	return (status);
}

uint8_t NOR_ReadByte(uint32_t _uiWriteAddr)
{
	uint8_t data;
	NOR_WRITE((NOR_FLASH_ADDR + _uiWriteAddr), 0x00F0 );

	return data = *(uint8_t *)(NOR_FLASH_ADDR + _uiWriteAddr);
}


void NOR_ReadBuffer(uint32_t _uiWriteAddr, uint8_t *_pBuf, uint32_t _uiBytes)
{
	uint8_t *pNor8;
	uint32_t i;

	pNor8 = (uint8_t *)(_uiWriteAddr + NOR_FLASH_ADDR);
	for (i = 0; i < _uiBytes; i++)
	{
		*_pBuf++ = *pNor8++;
	}
}

//uint8_t NOR_WriteByte(uint32_t _uiWriteAddr, uint8_t _usData)
//{
//	NOR_BWRITE(BYTE_ADDR(0x0555), 0xAA);
//	NOR_BWRITE(BYTE_ADDR(0x02AA), 0x55);
//	NOR_BWRITE(BYTE_ADDR(0x0555), 0xA0);
//	NOR_BWRITE(NOR_FLASH_ADDR + _uiWriteAddr, _usData);
//
//	return (NOR_GetStatus(Program_Timeout));
//}

uint8_t NOR_WriteByte(uint32_t _uiWriteAddr, uint8_t _usData)
{
	NOR_BWRITE(BYTE_ADDR(0xAAA), 0xAA);
	NOR_BWRITE(BYTE_ADDR(0x555), 0x55);
	NOR_BWRITE(BYTE_ADDR(0xAAA), 0xA0);
	NOR_BWRITE(NOR_FLASH_ADDR + _uiWriteAddr, _usData);

	return (NOR_GetStatus(Program_Timeout));
}


uint8_t NOR_WriteBuffer(uint32_t _uiWriteAddr, uint8_t *_pBuf, uint32_t _uiBytes)
{
	uint8_t usByte;
	uint32_t i;
	uint8_t ucStatus;

	for (i = 0; i < _uiBytes; i++)
	{
		usByte = *_pBuf++;
		ucStatus = NOR_WriteByte(_uiWriteAddr, usByte);
		if (ucStatus != NOR_SUCCESS)
		{
			return 	ucStatus;
		}

		_uiWriteAddr ++;
	}

	return 	ucStatus;
}

uint8_t flash_program(uint32_t addr, uint8_t * data, uint32_t len, uint8_t erase) {
	if(erase) {
		if(NOR_EraseSector(addr) != NOR_SUCCESS) {
			return NOR_ERROR;
		}

		if(NOR_WriteBuffer(addr, data, len) != NOR_SUCCESS) {
			return NOR_ERROR;
		}
	}else {
		if(NOR_WriteBuffer(addr, data, len) != NOR_SUCCESS) {
			return NOR_ERROR;
		}
	}

	return NOR_SUCCESS;
}
